## Combining Datasets: Merge and Join

In [8]:
# Pandas has high-performanace in memory join and merge operations.

# Relational Algebre
# The behviour implemented in pd.merge() is a subset of what is known as relatinal algebra,
# forms the foundation of operations in most databases.

# Categories of Joins
# The pd.mege() function implements a number of types of joins.
# one-to-one
# many-to-one
# many-to-many

#### One-to-one joins

In [11]:
import pandas as pd

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'group': ['Accounting','Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                   'hire_date': [2004, 2008, 2011, 2009]})
print(df1); print('-'*20); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2011
3      Sue       2009

In [13]:
# To combine the above two dataframes, we can use the pd.merge() function.

df3 = pd.merge(df1, df2)
print(df3)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2011
2     Lisa  Engineering       2004
3      Sue           HR       2009

#### Many-to-one joins

In [16]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'], 'supervisor': ['Carly', 'Guido', 'Steve']})

print(df3); print('-'*20); print(df4)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2011
2     Lisa  Engineering       2004
3      Sue           HR       2009
--------------------
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [18]:
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2011      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2009      Steve

In [20]:
pd.merge(df4, df3)

         group supervisor employee  hire_date
0   Accounting      Carly      Bob       2008
1  Engineering      Guido     Jake       2011
2  Engineering      Guido     Lisa       2004
3           HR      Steve      Sue       2009

#### Many-to-many joins

In [25]:
# if the key column in both the left and right array contains duplicates, then the result is a many to many merge.

df5 = pd.DataFrame({'group': ['Accounting', 'Accounting', 'Engineering','Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']})
print(df1); print('-'*20); print(df5)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [27]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [29]:
pd.merge(df5, df1)

         group        skills employee
0   Accounting          math      Bob
1   Accounting  spreadsheets      Bob
2  Engineering        coding     Jake
3  Engineering        coding     Lisa
4  Engineering         linux     Jake
5  Engineering         linux     Lisa
6           HR  spreadsheets      Sue
7           HR  organization      Sue

#### The on keyword

In [31]:
# Specification of the merge key
# as we saw, pd.merge() looks for one or more matching column names between the two inputs, and uses this as the key.
# However, the column names amay not match perfectly in some cases. In such cases pd.merge() provides variety of options for handling this.

# The on keyword
# you can explicitly specify the name of the column using the on keyword, which takes a column name or a list of column names.

print(df1); print('-'*20); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2011
3      Sue       2009

In [33]:
pd.merge(df1, df2, on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2011
2     Lisa  Engineering       2004
3      Sue           HR       2009

In [35]:
''' This option works only if both the left and the right DataFrames have the specified column name.
 • **The left_on and right_on keywords**
 Sometimes you may want to merge two DataFrames on column name/s with different names in the
 right and the left DataFrame.
 For instance, you may have ‘name’ as employee name in one DF and ‘employee’ on the other.
 Let’s see how we can join on those columns.
'''

' This option works only if both the left and the right DataFrames have the specified column name.\n • **The left_on and right_on keywords**\n Sometimes you may want to merge two DataFrames on column name/s with different names in the\n right and the left DataFrame.\n For instance, you may have ‘name’ as employee name in one DF and ‘employee’ on the other.\n Let’s see how we can join on those columns.\n'

In [37]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                     'salary': [70000, 80000, 120000, 90000]})
print(df1); print('-'*20); print(df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [39]:
# joining on 'employee' and 'name'
pd.merge(df1, df3, left_on = 'employee', right_on = 'name')

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [47]:
# 'name' column dropped
pd.merge(df1, df3, left_on = 'employee', right_on = 'name').drop('name',axis = 1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

#### The left_index and right_index keywords

In [55]:
# you can also merge on an index rather than a coulumn.

df1a = df1.set_index('employee')
# setting the 'employee' column as explicit index on df1
df2a = df2.set_index('employee')
# setting the 'employee' column as explicit index on df2

print(df1a); print('-'*30); print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
------------------------------
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2011
Sue            2009

In [57]:
pd.merge(df1a, df2a, left_index = True, right_index = True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2011
Lisa      Engineering       2004
Sue                HR       2009